Catalogs/СписокДелКредитногоДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СписокДелКредитногоДоговора</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Договоры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДела</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтадияДела</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадияДела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЦессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦессии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКредита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКредитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженностиПереданная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СтадияДела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтадияДела</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СудебноеПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банкротство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительноеПроизводство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СписокДелКредитногоДоговора/Forms/ФормаСпискаПарам/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 
	
	            Список.Параметры.УстановитьЗначениеПараметра("Владелец",Параметры.тДоговор);
				 
				 ФИОДолжника=Параметры.тДолжник;
				 Цедент=Параметры.тЦедент;
				 НомерДоговораЦессии=Параметры.тНомерДоговораЦессии;
				 
				 ДатаЦессии=Параметры.тДатаЦессии;
				 ВидПродукта=Параметры.тВидПродукта;
				 
				 СуммаЗадолженностиПереданная=Параметры.тСуммаЗадолженностиПереданная;
				 ОтветственныйСотрудник=Параметры.тОтветственныйСотрудник;
				 КрДоговор=Параметры.тДоговор;
				 
				  Если Параметры.Свойство("номерСтроки") Тогда

					  номерСтрокиСпрГруппаДог=Параметры.номерСтроки;

					  
				  КонецЕсли;	  
				  
				  Если Параметры.Свойство("спрГруппадоговоровЮристСсылка") Тогда

 	 		         спрГруппадоговоровЮристСсылка=Параметры.спрГруппадоговоровЮристСсылка;
					  
				  КонецЕсли;	  
				  
				   
				 
	   
	видимФСП=Новый Структура;
	
	видимФСП.Вставить("Период", ТекущаяДата());
	видимФСП.Вставить("Сотрудник", ПараметрыСеанса.Пользователь);
	
	УстановитьПараметрыФункциональныхОпцийФормы(видимФСП);

	 
	 
	 
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаСоздать(Команда)
	// Вставить содержимое обработчика.
	  	         парамСтруктура=Новый Структура;
				  
				  парамСтруктура.Вставить("тДолжник", ФИОДолжника);
				  
				  парамСтруктура.Вставить("тКрДоговор", КрДоговор);
				  
				  
				  парамСтруктура.Вставить("тЦедент", Цедент);
				  
				  парамСтруктура.Вставить("тНомерДоговораЦессии", НомерДоговораЦессии);
				  
				  парамСтруктура.Вставить("тДатаЦессии", ДатаЦессии);
				  
				  парамСтруктура.Вставить("тВидПродукта",ВидПродукта);
				  
				  парамСтруктура.Вставить("тСуммаЗадолженностиПереданная", СуммаЗадолженностиПереданная);
				  
				  парамСтруктура.Вставить("тОтветственныйСотрудник", ОтветственныйСотрудник);

		
	   ОткрытьФорму("Справочник.СписокДелКредитногоДоговора.Форма.ФормаЭлемента",парамСтруктура,ЭтаФорма);

	

	
	
КонецПроцедуры


&НаСервере
Функция СтадияСудебноеПроизводство()

	Возврат Перечисления.СтадияДела.СудебноеПроизводство;
	

КонецФункции // ()


&НаСервере
Функция СтадияИсполнительноеПроизводство()

	Возврат Перечисления.СтадияДела.ИсполнительноеПроизводство;
	

КонецФункции // ()




&НаКлиенте
Процедура Производство(Команда)
	
	  ФункцииДляОтчетов.СписокДелКредитногоДоговораУстановитьДатаПоследнегоПлатежа();
	  
	  Сообщить("Ок");
	
	//// Вставить содержимое обработчика.
	//
	//   //ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки; 
	//   
	//   
	//   судебноеПроизводство=СтадияСудебноеПроизводство();
	//   
	//   ТекСтрока = Элементы.Список.ТекущаяСтрока;
	//   
	//   ДанныеСтр = Элементы.Список.ДанныеСтроки(ТекСтрока);
	//   
	//   
	//   Если Не ДанныеСтр.ПометкаУдаления Тогда
	//	   
	//	    Если ДанныеСтр.СтадияДела=судебноеПроизводство  Тогда
	//			
	//			  парамСтруктура=Новый Структура;
	//			  парамСтруктура.Вставить("тДоговор", ДанныеСтр.КредитныйДоговор);
	//			  
	//			  парамСтруктура.Вставить("НомерДела", ДанныеСтр.НомерДела);
	//			  
	//			  
	//			  //
	//			  //парамСтруктура.Вставить("тЦедент", ДанныеСтр.Банк);
	//			  //
	//			  //парамСтруктура.Вставить("тНомерДоговораЦессии", Элемент.ТекущиеДанные.НомерДоговораЦессии);
	//			  //
	//			  //парамСтруктура.Вставить("тДатаЦессии", Элемент.ТекущиеДанные.ДатаЦессии);
	//			  //
	//			  //парамСтруктура.Вставить("тВидПродукта", Элемент.ТекущиеДанные.ВидПродукта);
	//			  //
	//			  //парамСтруктура.Вставить("тСуммаЗадолженностиПереданная", Элемент.ТекущиеДанные.СуммаЗадолженностиПереданная);
	//			  //
	//			  //парамСтруктура.Вставить("тОтветственныйСотрудник", Элемент.ТекущиеДанные.ОтветственныйСотрудник);
	//			  //
	//			  //
	//			  //
	//			  
	//			  // Элемент.ТекущиеДанные.КрДоговор
	//  
	//              ОткрытьФорму("Обработка.СудебнаяСтадия.Форма.Форма",парамСтруктура,ЭтаФорма);
	//  
	//  
	//			   //ОткрытьФорму("Справочник.СписокДелКредитногоДоговора.Форма.ФормаСписка",парамСтруктура,ЭтаФорма); 

	//			
	//			   //А=0;
	//			
	//			
	//		
	//		КонецЕсли;
	//	   
	//	   
	//	   
	//       
	//   КонецЕсли;	   
	//   
	//   
	   
	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка=Ложь;
	
	    судебноеПроизводство=СтадияСудебноеПроизводство();
		исполнительноеПроизводство=СтадияИсполнительноеПроизводство();
	   
	   ТекСтрока = Элементы.Список.ТекущаяСтрока;
	   
	   ДанныеСтр = Элементы.Список.ДанныеСтроки(ТекСтрока);
	   
	   
	   Если Не ДанныеСтр.ПометкаУдаления Тогда
		   
		    Если ДанныеСтр.СтадияДела=судебноеПроизводство  Тогда
				
				  парамСтруктура=Новый Структура;
				  парамСтруктура.Вставить("тДоговор", ДанныеСтр.КредитныйДоговор);
				  
				  парамСтруктура.Вставить("НомерДела", ДанныеСтр.НомерДела);
				  
				  парамСтруктура.Вставить("ДатаДела", ДанныеСтр.ДатаДела);
				  
				  парамСтруктура.Вставить("ссылкаДела", ДанныеСтр.Ссылка);
				  
				  парамСтруктура.Вставить("номерСтрокиСпрГруппаДог", номерСтрокиСпрГруппаДог);
				  
				  парамСтруктура.Вставить("спрГруппадоговоровЮристСсылка", спрГруппадоговоровЮристСсылка);
				  
				  
				  
				  
				  //парамСтруктура.Вставить("тЦедент", ДанныеСтр.Банк);
				  
				  
				  парамСтруктура.Вставить("тНомерДоговораЦессии", Элемент.ТекущиеДанные.НомерЦессии);
				  
				  парамСтруктура.Вставить("тДатаЦессии", Элемент.ТекущиеДанные.ДатаЦессии);
				  
				  //
				  //парамСтруктура.Вставить("тВидПродукта", Элемент.ТекущиеДанные.ВидПродукта);
				  //
				  //парамСтруктура.Вставить("тСуммаЗадолженностиПереданная", Элемент.ТекущиеДанные.СуммаЗадолженностиПереданная);
				  //
				  //парамСтруктура.Вставить("тОтветственныйСотрудник", Элемент.ТекущиеДанные.ОтветственныйСотрудник);
				  //
				  //
				  //
				  
				  // Элемент.ТекущиеДанные.КрДоговор
	  
	              ОткрытьФорму("Обработка.СудебнаяСтадия.Форма.Форма",парамСтруктура,ЭтаФорма);
				  
				  
	  
				   //ОткрытьФорму("Справочник.СписокДелКредитногоДоговора.Форма.ФормаСписка",парамСтруктура,ЭтаФорма); 

				
				   //А=0;
				
				
			
			 КонецЕсли;
			   
			 Если ДанныеСтр.СтадияДела=исполнительноеПроизводство  Тогда
				 
				   парамСтруктура=Новый Структура;
				  парамСтруктура.Вставить("тДоговор", ДанныеСтр.КредитныйДоговор);
				  
				  парамСтруктура.Вставить("НомерДела", ДанныеСтр.НомерДела);
				  
				  парамСтруктура.Вставить("ДатаДела", ДанныеСтр.ДатаДела);
				  

				   ОткрытьФорму("Обработка.ИсполнительноеПроизводство.Форма.Форма",парамСтруктура,ЭтаФорма);
				 
				 
				 
				 
			 КонецЕсли; 
		   
			  
			  
		   
	       
	   КонецЕсли;
	
	
	
	
КонецПроцедуры
